Tekla Open API Reference for Tekla Structures 2025
RebarLeg Properties
The RebarLeg type exposes the following members.
Properties
Name | Description
Curve
 Gets the curve of the leg
Origin
 Gets the origin of the leg
Top
See Also
Reference
RebarLeg Class
Tekla.Structures.Model Namespace